Tekla Open API Reference for Tekla Structures 2025
NumberingSeries Class
 The NumberingSeries class describes how an object is to be numbered.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.NumberingSeries
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class NumberingSeries
<SerializableAttribute>
Public NotInheritable Class NumberingSeries
The NumberingSeries type exposes the following members.
Constructors
Name | Description
NumberingSeries()
 Instantiates a default numbering.
NumberingSeries(String, Int32)
 Instantiates a numbering series with the given arguments.
Top
Properties
Name | Description
Prefix
 The prefix in numbering.
StartNumber
 The start number in numbering.
Top
See Also
Reference
Tekla.Structures.Model Namespace